<?php
// 1-Борщ
// 2-Пельмени
// 3-Салат Цезарь
// 4-Пюрешка
// 5-Спагетти
$order = 3; // Номер выбранного блюда

// Подсчет стоимости заказа в зависимости от выбора пользователя с помощью match
$result = match ($order) {
    1 => ["dish" => "Борщ", "price" => 1000],
    2 => ["dish" => "Пельмени", "price" => 2000],
    3 => ["dish" => "Салат Цезарь", "price" => 700],
    4 => ["dish" => "Пюрешка", "price" => 550],
    5 => ["dish" => "Спагетти", "price" => 1590],
    default => "Выбрано неверное блюдо, выберите блюда 1-5."
};

// Вывод итоговой стоимости заказа
if (is_array($result)) {
    echo "Вы выбрали: {$result['dish']} за {$result['price']} тг.";
} else {
    echo $result;
}
?>